{
    "projects": [
        {
            "date": "12/2023 - Present",
            "title": "Full Stack Developer",
            "description": "passionate about building scalable web applications and seamless user experiences. Skilled in React, Node.js, Express, MongoDB, and modern authentication tools. Experienced in integrating AI models and deploying full-stack projects. Always eager to learn & craft clean, efficient code.",
            "imgSrc": "https://i.ibb.co/8dyQzz2/pexels-cottonbro-studio-7437088.jpg"
        },
        {
            
            "title": "Software Developer Intern",
            "url": "https://drive.google.com/drive/folders/1F-4absUqr42PMioedtXgZ-uIxlYaAT83?usp=sharing",
            "description": "Computer Science student adept in HTML, CSS, and JavaScript. Hands-on experience in project setup, requirements analysis, and collaborating on development and testing. Eager to contribute and learn.",
            "imgSrc": "https://i.ibb.co/8dyQzz2/pexels-cottonbro-studio-7437088.jpg"
        }
        ,
        {
            "date": "01/01/2024 - Present",
            "title": "Portfolio Project",
            "description": "Passionate Web Developer skilled in crafting engaging and responsive user interfaces. Eager to contribute innovative solutions and evolve as a web developer.",
            "url": "/",
            "imgSrc": "https://cdn.pixabay.com/photo/2020/03/19/21/25/cactus-4948833_960_720.jpg"
        },
        {
            "date": "09/2024 - 12/2024",
            "title": "Real Estate Platform",
            "description": "Developed a real estate web platform using React.js, Node.js, Express, and MongoDB, enabling users to list, search, and save properties with features like map-based search using Leaflet, real-time chat, and secure authentication with JWT.",
            "url": "",
            "imgSrc": "https://i.ibb.co/DPRFcxdR/real-estate-6688945-1280.jpg"
        },
        
        {
            "date": "06/2023 - 08/2023",
            "title": "LILITH AI",
            "description": "Lilith AI is a full-stack AI-powered chat application built with React, Express (Node.js), MongoDB Atlas, and Google Gemini AI, with Clerk authentication for secure login and signup.",
            "url": "https://github.com/sajidkhan00107/LILITH-AI",
            "imgSrc":  "https://i.ibb.co/1GTzJL5Z/Screenshot-2025-05-09-162107.png"

        },{
            "date": "01/2024 - 04/2024",
            "title": "Pasmec",
            "description": "Designed and developed a responsive website for ”Pasmec,” a building construction company, using HTML, CSS, and JavaScript. Focused on creating an attractive UI and showcasing the company’s services effectively.",
            "url": "http://pasmecbim.com/About%20Us/about.html",
            "imgSrc":  "https://i.ibb.co/1Y4GBW2T/ip5.png"

        }
       

    ]
}