{
    "projects": [
        {
            "date": "12/2022 - Present",
            "title": " MERN Stack Developer",
            "description": "Dynamic Computer Science graduate skilled in MERN stack, proficient in front-end and back-end development. Motivated to contribute to projects and enhance skills.",
            "imgSrc": "https://i.ibb.co/8dyQzz2/pexels-cottonbro-studio-7437088.jpg"
        },
        {
            "date": "01/01/2024 - Present",
            "title": "PORTFOLIO",
            "description": "Passionate Junior React Developer skilled in crafting engaging and responsive user interfaces.Eager to contribute innovative solutions and evolve as a web developer.",
            "url": "/",
            "imgSrc": "https://cdn.pixabay.com/photo/2020/03/19/21/25/cactus-4948833_960_720.jpg"
        },
        {
            "date": "Ongoing",
            "title": "Real Estate",
            "description": "Developed a real estate web platform using React.js, Node.js, Express, and MongoDB, enabling users to list, search, and save properties with features like map-based search using Leaflet, real-time chat, and secure authentication with JWT.",
            "url": "https://github.com/JahirMullick/Real-Estate",
            "imgSrc": "https://i.ibb.co/DPRFcxdR/real-estate-6688945-1280.jpg"
        },
        {
            "date": "04/03/2024",
            "title": "Weather App",
            "description": "Passionate about web development, I've created a dynamic weather app that delivers weather updates and forecasts. For a deeper understanding of my work, please click the button below.",
            "url": "https://weather-data-app-c.netlify.app/",
            "imgSrc": "https://i.ibb.co/r0qX6ZG/Capture.png"
        },
        {
            "date": "17/10/2023",
            "title": "Todo List",
            "description": "Passionate React developer. Proficient in creating engaging UIs and ensuring seamless user interactions. Eager to contribute projects and amplify productivity through technology.",
            "url": "https://vite-project-todo-list.vercel.app/",
            "imgSrc": "https://i.ibb.co/xzp0zfk/pexels-polina-kovaleva-5717413.jpg"
        },
        {
            "date": "03/2022 - 06/2022",
            "title": "Software Developer Intern",
            "description": "Computer Science student adept in HTML, CSS, and JavaScript. Hands-on experience in project setup, requirements analysis, and collaborating on development and testing. Eager to contribute and learn.",
            "imgSrc": "https://i.ibb.co/8dyQzz2/pexels-cottonbro-studio-7437088.jpg"
        }
    ]
}